# pipex

## Описание

Pipex — это программа, которая принимает на вход названия файлов и произвольные shell-команды.

Задача написать программу на языке C, которая будет вызываться следующим образом:

```./pipex file1 cmd1 cmd2 file2```

---

У программы должно быть 4 аргумента:

* `file1` и `file2` - названия файлов,
* `cmd1` и `cmd2` - shell-команды со своими параметрами.

---

Программа должна вести себя точно так же, как приведённая команда ниже:

`$> < file1 cmd1 | cmd2 > file2`

---

### Разрешенные функции

open, close, read, write, 
malloc, free, perror, strerror, 
access, dup, dup2, execve, 
exit, fork, pipe, unlink, 
wait, waitpid, ft_printf (или написать любой другой аналог)

Использование libft запрещено.

### Структура проекта

`Makefile, *.h, *.c`

Makefile должен содержать команды `$(NAME), all, clean, fclean и re`.

## Примеры вызова программы

---

```$> ./pipex infile "ls -l" "wc -l" outfile```
 
 Аналог: `< infile ls -l | wc -l > outfile`

 ---

```$> ./pipex infile "grep a1" "wc -w" outfile``` 

Аналог: `< infile grep a1 | wc -w > outfile`

---

## Требования

- Необходимо добавить Makefile, который скомпилирует все файлы. Перекомпиляция должна происходить только в случае необходимости.
- Необходимо обрабатывать все ошибки. Программа не должна завершаться неожиданно.
- Не должно быть утечек памяти.
- Ошибки должны быть обработаны как у shell-команды ```< file1 cmd1 | cmd2 > file2```